tap "hashicorp/tap"
tap "homebrew/services"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "netbirdio/tap"
tap "reeywhaar/tap"

# Tools
brew "autojump" # Quick directory jumps (oh-my-zsh autojump plugin)
brew "bat" # Better cat
brew "cloud-sql-proxy" # Cloud SQL Proxy
brew "eza" # Better ls (exa successor)
brew "fzf" # CLI fuzzy finder
brew "git" # Git
brew "graphicsmagick" # Image Processing
brew "hashicorp/tap/terraform" # Terraform
brew "jq" # JSON Processing
brew "mas" # Mac App Store CLI
brew "nvm" # Node Version Manager
brew "powerlevel10k" # Theme for ZSH
brew "pure" # Shell Prompt
brew "reeywhaar/tap/tmbliss" # Exclude files from Time Machine backups https://github.com/Reeywhaar/tmbliss/blob/main/readme.md
brew "rustup" # Rust
brew "trivy" # Security Scanner
brew "wget" # Web Downloader
brew "zsh-async" # Zsh Async

# Applications
## Browsers
cask "arc"
cask "brave-browser"
cask "firefox"
cask "google-chrome"

## Productivity
cask "1password" # Password Manager
cask "betterdisplay" # Display Manager
cask "caffeine" # Prevent Sleep
cask "figma" # Design Tool
cask "hiddenbar" # Hide Icons in Menu Bar
cask "kap" # Screen Recording
cask "loom" # Video Recording
cask "little-snitch" # Firewall & Network Monitoring
cask "meetingbar" # Preview Meetings in Menu Bar
cask "netbirdio/tap/netbird-ui" # VPN
cask "notunes" # Prevent iTunes or Apple Music from launching on ▶️-Button
cask "raindropio" # Bookmark Manager
cask "reader" # Read Later Tool
cask "rectangle" # Window Manager
cask "shottr" # Screenshot Tool
cask "slack" # Communication Tool
cask "spotify" # Music Player
cask "the-unarchiver" # Archive Manager
cask "vlc" # Media Player
cask "whatsapp" # Communication Tool

## Devtools
cask "cursor" # Code Editor
cask "docker-desktop" # Docker Desktop
cask "font-monaspace" # Font
cask "gcloud-cli" # Google Cloud CLI
cask "imageoptim" # Image Optimizer
cask "kiro-cli" # CLI for Kiro AI enhanced command line
cask "postman" # API Testing
cask "tableplus" # Database Management
cask "visual-studio-code" # Code Editor
cask "warp" # Terminal
